import{u}from"./vue-router-ee9931d1.js";import{u as v,a as x}from"./index-ce7e7fba.js";import{l as i,m as n,B as h,u as t,q as s,e as b,w as g,F as o,z as a,D as k,A as c}from"./@vue-5e60537e.js";import"./yandex-metrika-vue3-31715aa8.js";import"./@vueuse-6ebe5ee8.js";import"./firebase-6ed2b05d.js";import"./@firebase-40ef63b3.js";import"./idb-81bdbf9b.js";import"./picocolors-7608e719.js";import"./tailwindcss-animation-delay-bb812693.js";import"./tailwindcss-f34f17cc.js";import"./tailwind-scrollbar-b75acc9f.js";import"./nouislider-b0ecb9ee.js";const f="/gs/images/header.webp",w=s("g",{transform:"translate(0.000000,1280.000000) scale(0.100000,-0.100000)",class:"fill fill-purple",stroke:"none"},[s("path",{d:`M4905 12790 c-384 -29 -651 -67 -1320 -186 -353 -63 -430 -81 -535
  -124 -297 -123 -479 -329 -535 -607 -14 -68 -16 -127 -13 -330 4 -235 6 -252
  30 -326 41 -122 98 -210 213 -324 l102 -101 -7 -79 c-4 -62 -11 -87 -34 -123
  -16 -25 -135 -153 -265 -285 -130 -132 -253 -265 -273 -296 -68 -103 -76 -139
  -120 -496 l-41 -333 -51 -16 c-90 -28 -329 -152 -418 -216 -322 -233 -563
  -523 -843 -1013 -116 -204 -199 -370 -236 -475 -17 -48 -23 -88 -24 -150 0
  -82 1 -88 47 -175 27 -52 79 -126 120 -174 127 -145 134 -163 104 -235 -11
  -26 -25 -37 -62 -51 -311 -114 -431 -197 -521 -364 -83 -151 -112 -258 -157
  -571 -57 -395 -80 -832 -52 -985 51 -276 108 -352 319 -431 99 -36 112 -46
  122 -85 6 -23 0 -30 -61 -70 -183 -119 -253 -257 -226 -445 39 -268 298 -972
  440 -1194 63 -99 224 -291 281 -336 67 -52 204 -108 381 -154 154 -39 185 -52
  200 -81 19 -35 13 -117 -14 -197 -41 -119 -50 -210 -32 -322 27 -168 53 -217
  210 -391 259 -287 866 -772 1121 -894 133 -65 342 -101 540 -93 102 3 105 4
  162 43 43 29 65 54 84 92 l26 51 84 -85 c46 -46 103 -96 126 -109 58 -35 175
  -46 478 -48 l250 -1 62 34 c78 42 173 127 218 196 55 81 57 82 94 26 73 -114
  196 -189 343 -211 213 -32 355 14 581 187 l58 45 37 -39 c57 -58 121 -77 245
  -70 121 6 203 32 344 107 215 115 439 287 658 505 354 353 535 646 535 868 0
  87 -24 141 -100 222 -33 35 -60 69 -60 75 0 6 5 32 11 57 11 40 17 48 56 65
  24 10 108 33 186 50 267 57 378 116 494 261 215 270 440 784 503 1151 58 339
  -3 518 -215 633 -70 38 -70 38 -73 85 -4 62 17 80 121 108 250 67 301 125 349
  390 17 96 17 593 0 775 -31 329 -75 615 -113 735 -50 158 -123 231 -348 345
  -131 67 -171 99 -199 158 -39 83 -38 97 14 157 95 110 119 214 90 375 -58 317
  -271 777 -562 1215 -105 157 -172 242 -280 352 -125 129 -203 176 -376 232
  -78 25 -162 50 -184 56 -39 10 -42 12 -48 56 l-6 47 108 111 c241 250 368 511
  402 828 13 121 2 284 -29 411 l-18 77 46 -1 c25 0 126 -6 225 -13 148 -10 181
  -15 191 -29 70 -95 290 -565 428 -912 239 -600 426 -1194 660 -2095 382 -1464
  705 -3160 832 -4360 l24 -225 56 -150 c32 -82 61 -158 67 -168 16 -31 87 -57
  154 -57 149 0 269 116 349 340 75 212 96 384 76 635 -63 794 -312 2130 -647
  3470 -205 818 -396 1473 -676 2308 -286 857 -488 1384 -752 1962 -121 264
  -418 838 -493 954 -46 69 -169 193 -244 244 -51 35 -67 40 -190 58 -443 66
  -906 110 -1449 139 -270 14 -1010 21 -1155 10z m1510 -2030 c61 -6 193 -17
  295 -25 101 -8 187 -19 191 -23 13 -15 59 -142 75 -208 22 -93 22 -287 0 -379
  -26 -109 -89 -264 -114 -279 -5 -3 -15 14 -21 37 -31 104 -125 213 -387 444
  -94 85 -192 203 -218 264 -8 20 -18 70 -22 113 l-7 77 49 -5 c27 -3 99 -10
  159 -16z`})],-1),y=[w],S={__name:"GrenadeIcon",setup(m){const{width:r}=v();return(l,e)=>(i(),n("svg",{version:"1.0",xmlns:"http://www.w3.org/2000/svg",width:"40",viewBox:"0 0 1052.000000 1280.000000",class:h(t(r)==="xxl"?"w-10":"-mr-1 w-5")},y,2))}};const V={class:"align-center relative flex flex-col -mt-16"},z={key:0,src:f,alt:"main",class:"min-h-[150px] w-full object-cover"},B={key:1,class:"px-6 text-right text-3xl text-purple xxl:text-6xl fixed right-8 top-15 name-shadow"},G={key:2,class:"px-8 transition-opaciry",ref:"body"},H=s("div",{class:"text-xl lg:text-2xl mb-2"},[s("span",null,[a(" Интерактивный редактор персонажа, дерево крафта и библиотека оружия для твоей любимой карты. "),s("br"),a("Актуально для версии 1.5b ")])],-1),N=s("div",{class:"indent-8"}," Небольшой гоблинской экспедиции становится известным о старой заброшенной пещере, в которой несколько сотен лет назад пропала безвести целая бригада гномов-археологов. ",-1),T=s("div",{class:"indent-8"}," Всё-бы ничего, но в той бригаде было множество очень умных инженеров-механиков, и все свои секретные чертежи и разработки были утеряны вместе с ними. Никому неизвестно почему именно пропала та бригада, но известно лишь что они откопали в глубине скальной породы несколько храмовых помещений, в которых, по всей видимости, жили самые первые гномы. ",-1),M=s("div",{class:"indent-8"}," Отважные и обезбашенные гоблины разбивают лагерь перед входом в пещеру, настраивают мини-телепорты для передачи предметов с поверхности, и спускаются в заброшенную шахту, с надеждой выкрасть и найти уникальные секреты гномов и научиться использовать их в своих смертоносных сумасшедших изобретениях... ",-1),$=[H,N,T,M],q={key:3,class:"flex h-full gap-4 mt-20"},C={class:"w-1/2"},D={class:"text-active text-3xl my-4 px-4 w-fit"},L={class:"w-full animate-leftToRight rounded-r-xl border border-l-0 border-second p-4 text-2xl h-fit"},R={class:"mx-auto w-2/3 mt-16"},j={key:0,class:"text-2xl text-active py-2"},A={key:1,class:"rounded-r-xl border border-second p-4 mb-2 bg-primary leading-5"},E=["innerHTML"],F={key:0,class:"text-green"},I={key:1,class:"text-purple"},J={key:2,class:"text-red"},o1={__name:"HomeView",setup(m){const r=u(),l=b(()=>r.query.goblin),{user:e,setSkill:p}=x();return g(()=>l.value,()=>{var d;p((d=e.goblin)==null?void 0:d.abilities[0])}),(d,K)=>{var _;return i(),n("main",V,[l.value?o("",!0):(i(),n("img",z)),l.value?o("",!0):(i(),n("div",B,[a(" G"),k(S,{class:"mb-2 inline"}),a("blin Survival ")])),l.value?o("",!0):(i(),n("div",G,$,512)),l.value&&t(e).goblin?(i(),n("div",q,[s("div",C,[s("div",D,c(t(e).goblin.name),1),s("div",L,c(t(e).goblin.description),1)]),s("div",R,[t(e).activeSkill?(i(),n("div",j,c(t(e).activeSkill.name),1)):o("",!0),(_=t(e).activeSkill)!=null&&_.description?(i(),n("div",A,[s("div",{innerHTML:t(e).activeSkill.description},null,8,E),t(e).activeSkill.cd?(i(),n("div",F,"кд: "+c(t(e).activeSkill.cd)+" сек",1)):o("",!0),t(e).activeSkill.dur?(i(),n("div",I," длительность: "+c(t(e).activeSkill.dur)+" сек ",1)):o("",!0),t(e).activeSkill.mc?(i(),n("div",J," манакост: "+c(t(e).activeSkill.mc)+" маны ",1)):o("",!0)])):o("",!0)])])):o("",!0)])}}};export{o1 as default};
